Repository: brotoo25/GL.iNet-Connect-App
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# loginTitle
source: Router Login
es: Inicio de Sesión del Router
pt: Login do Roteador

# loginSubtitle
source: Enter your router's admin password.
es: Ingresa la contraseña de administrador de tu router.
pt: Digite a senha de administrador do seu roteador.

source: Admin Password
es: Contraseña de Administrador
pt: Senha de Administrador

# passwordHint
source: Password
es: Contraseña
pt: Senha

source: Show password
es: Mostrar contraseña
pt: Mostrar senha

source: Hide password
es: Ocultar contraseña
pt: Ocultar senha

source: Login
es: Iniciar Sesión
pt: Entrar

# pleaseEnterPassword
source: Please enter the admin password
es: Por favor, ingresa la contraseña de administrador
pt: Por favor, digite a senha de administrador

source: Dashboard
es: Panel
pt: Painel

source: Set Up Wi-Fi Repeater
es: Configurar Repetidor Wi-Fi
pt: Configurar Repetidor Wi-Fi

source: Last checked: just now
es: Verificado: justo ahora
pt: Verificado: agora mesmo

# lastCheckedSecondsAgo
source: Last checked: {seconds} seconds ago
es: Verificado: hace {seconds} segundos
pt: Verificado: há {seconds} segundos

# lastCheckedMinuteAgo
source: Last checked: 1 minute ago
es: Verificado: hace 1 minuto
pt: Verificado: há 1 minuto

# lastCheckedMinutesAgo
source: Last checked: {minutes} minutes ago
es: Verificado: hace {minutes} minutos
pt: Verificado: há {minutes} minutos

# lastCheckedHourAgo
source: Last checked: 1 hour ago
es: Verificado: hace 1 hora
pt: Verificado: há 1 hora

# lastCheckedHoursAgo
source: Last checked: {hours} hours ago
es: Verificado: hace {hours} horas
pt: Verificado: há {hours} horas

source: Phone Wi-Fi
es: Wi-Fi del Teléfono
pt: Wi-Fi do Telefone

source: Currently Connected:
es: Conectado Actualmente:
pt: Conectado Atualmente:

source: Not Connected
es: No Conectado
pt: Não Conectado

# phoneWifiDescription
source: This is the network your phone is using.
es: Esta es la red que tu teléfono está usando.
pt: Esta é a rede que seu telefone está usando.

source: Router Internet Status
es: Estado de Internet del Router
pt: Status de Internet do Roteador

source: Router Internet Connection
es: Conexión de Internet del Router
pt: Conexão de Internet do Roteador

source: Checking connection...
es: Verificando conexión...
pt: Verificando conexão...

source: Connected
es: Conectado
pt: Conectado

source: Disconnected
es: Desconectado
pt: Desconectado

# routerOnlineDescription
source: Your router is online and accessing the internet.
es: Tu router está en línea y accediendo a internet.
pt: Seu roteador está online e acessando a internet.

# routerOfflineDescription
source: The router is not connected to the internet.
es: El router no está conectado a internet.
pt: O roteador não está conectado à internet.

source: Wi-Fi Configuration List
es: Lista de Configuración Wi-Fi
pt: Lista de Configuração Wi-Fi

# chooseNetworkToRepeat
source: Choose a network for the router to repeat.
es: Elige una red para que el router repita.
pt: Escolha uma rede para o roteador repetir.

# noNetworksFound
source: No networks found. Tap refresh to scan again.
es: No se encontraron redes. Toca actualizar para buscar de nuevo.
pt: Nenhuma rede encontrada. Toque em atualizar para buscar novamente.

# scanFailed
source: Scan failed: {error}
es: Error en la búsqueda: {error}
pt: Falha na busca: {error}

# connectionFailed
source: Connection failed: {error}
es: Error en la conexión: {error}
pt: Falha na conexão: {error}

# connectedTo
source: Connected to {ssid}
es: Conectado a {ssid}
pt: Conectado a {ssid}

source: Enter password for
es: Ingresa la contraseña para
pt: Digite a senha para

source: Cancel
es: Cancelar
pt: Cancelar

source: Connect
es: Conectar
pt: Conectar

source: Scan QR Code
es: Escanear Código QR
pt: Escanear Código QR

source: Scan WiFi QR Code
es: Escanear Código QR de Wi-Fi
pt: Escanear Código QR de Wi-Fi

source: Toggle flash
es: Alternar flash
pt: Alternar flash

# pointCameraAtQr
source: Point your camera at a WiFi QR code
es: Apunta tu cámara a un código QR de Wi-Fi
pt: Aponte sua câmera para um código QR de Wi-Fi

source: Invalid WiFi QR code
es: Código QR de Wi-Fi inválido
pt: Código QR de Wi-Fi inválido

# qrCodeNoValidSsid
source: QR code does not contain a valid SSID
es: El código QR no contiene un SSID válido
pt: O código QR não contém um SSID válido

source: Logout
es: Cerrar Sesión
pt: Sair

# logoutConfirmation
source: Are you sure you want to logout?
es: ¿Estás seguro de que deseas cerrar sesión?
pt: Tem certeza que deseja sair?

source: Retry
es: Reintentar
pt: Tentar Novamente

source: Router Unreachable
es: Router Inaccesible
pt: Roteador Inacessível

# routerUnreachableMessage
source: Router unreachable. Please connect to the GL.iNet router network.
es: Router inaccesible. Por favor, conéctate a la red del router GL.iNet.
pt: Roteador inacessível. Por favor, conecte-se à rede do roteador GL.iNet.

source: Authentication Failed
es: Error de Autenticación
pt: Falha na Autenticação

# storedCredentialsInvalid
source: Stored credentials are invalid. Please log in again.
es: Las credenciales almacenadas son inválidas. Por favor, inicia sesión de nuevo.
pt: Credenciais armazenadas são inválidas. Por favor, faça login novamente.

# autoLoginFailed
source: Auto-login failed. Please log in manually.
es: Error en el inicio de sesión automático. Por favor, inicia sesión manualmente.
pt: Falha no login automático. Por favor, faça login manualmente.

source: Login successful
es: Inicio de sesión exitoso
pt: Login bem-sucedido

source: Network Error
es: Error de Red
pt: Erro de Rede

source: Login Failed
es: Error de Inicio de Sesión
pt: Falha no Login

# unexpectedError
source: An unexpected error occurred: {error}
es: Ocurrió un error inesperado: {error}
pt: Ocorreu um erro inesperado: {error}

source: Session Expired
es: Sesión Expirada
pt: Sessão Expirada

# sessionExpiredMessage
source: Your session has expired. Please log in again to continue.
es: Tu sesión ha expirado. Por favor, inicia sesión de nuevo para continuar.
pt: Sua sessão expirou. Por favor, faça login novamente para continuar.

source: Help
es: Ayuda
pt: Ajuda

source: Rate the App
es: Calificar la App
pt: Avaliar o App

source: About
es: Acerca de
pt: Sobre

source: How to Use
es: Cómo Usar
pt: Como Usar

source: Got it!
es: ¡Entendido!
pt: Entendi!

# helpStep1Title
source: 1. Connect to Your Router
es: 1. Conéctate a Tu Router
pt: 1. Conecte-se ao Seu Roteador

# helpStep1Description
source: Make sure your phone is connected to your GL.iNet router's WiFi network.
es: Asegúrate de que tu teléfono esté conectado a la red WiFi de tu router GL.iNet.
pt: Certifique-se de que seu telefone está conectado à rede WiFi do seu roteador GL.iNet.

# helpStep2Title
source: 2. Log In
es: 2. Inicia Sesión
pt: 2. Faça Login

# helpStep2Description
source: Enter your router admin password (the same one you use for the web interface).
es: Ingresa la contraseña de administrador de tu router (la misma que usas en la interfaz web).
pt: Digite a senha de administrador do roteador (a mesma usada na interface web).

# helpStep3Title
source: 3. Scan for Networks
es: 3. Buscar Redes
pt: 3. Buscar Redes

# helpStep3Description
source: Tap "Set Up Wi-Fi Repeater" to scan for available WiFi networks to repeat.
es: Toca "Configurar Repetidor Wi-Fi" para buscar redes WiFi disponibles para repetir.
pt: Toque em "Configurar Repetidor Wi-Fi" para buscar redes WiFi disponíveis para repetir.

# helpStep4Title
source: 4. Select & Connect
es: 4. Seleccionar y Conectar
pt: 4. Selecionar e Conectar

# helpStep4Description
source: Choose a network and enter its password. Your router will extend that network's coverage.
es: Elige una red e ingresa su contraseña. Tu router extenderá la cobertura de esa red.
pt: Escolha uma rede e digite sua senha. Seu roteador estenderá a cobertura dessa rede.

# helpStep5Title
source: 5. Verify Connection
es: 5. Verificar Conexión
pt: 5. Verificar Conexão

# helpStep5Description
source: The dashboard shows your router's internet status. Green means connected!
es: El panel muestra el estado de internet de tu router. ¡Verde significa conectado!
pt: O painel mostra o status de internet do seu roteador. Verde significa conectado!

# aboutDescription
source: Configure your GL.iNet router as a WiFi repeater with ease.
es: Configura tu router GL.iNet como repetidor WiFi con facilidad.
pt: Configure seu roteador GL.iNet como repetidor WiFi com facilidade.

# inAppReviewNotAvailable
source: In-app review is not available. The app store listing will open once the app is published.
es: La calificación en la app no está disponible. La página de la tienda se abrirá cuando la app sea publicada.
pt: Avaliação no app não disponível. A página da loja será aberta quando o app for publicado.

source: Location Permission Required
es: Permiso de Ubicación Requerido
pt: Permissão de Localização Necessária

# locationPermissionMessage
source: To display the WiFi network name, location permission is needed. Please enable it in app settings.
es: Para mostrar el nombre de la red WiFi, se necesita permiso de ubicación. Por favor, habilítalo en la configuración de la app.
pt: Para exibir o nome da rede WiFi, é necessária permissão de localização. Por favor, habilite nas configurações do app.

source: Open Settings
es: Abrir Configuración
pt: Abrir Configurações
